InformationRegisters/bitmobile_КонтролируемыеИзмеренияРегистров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>bitmobile_КонтролируемыеИзмеренияРегистров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ИмяРегистра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяИзмерения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/bitmobile_НастройкиСинхронизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>bitmobile_НастройкиСинхронизации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОбъектаBitmobile</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгрузкаДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагрузкаДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеремещатьPrivateВShared</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФильтрВBitmobile</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФильтрВКонфигурации</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПозицияВВыгрузке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РеквизитыШапки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РеквизитОбъектаBitmobile</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитОбъектаКонфигурации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтандартныйРеквизит</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроверятьЗаполнение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриводитьКСтроке</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТабличныеЧасти</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТабличнаяЧастьОбъектаBitmobile</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТабличнаяЧастьОбъектаКонфигурации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстЗапроса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Фильтр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Запрос</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РеквизитыТабличныхЧастей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТабличнаяЧастьОбъектаКонфигурации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитОбъектаBitmobile</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитОбъектаКонфигурации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтандартныйРеквизит</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроверятьЗаполнение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриводитьКСтроке</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючевоеПоле</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СвязанныеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяТЧ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Настройка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.bitmobile_НастройкиСинхронизации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/bitmobile_КонтролируемыеИзмеренияРегистров/Forms/ФормаЗаписи/Ext/Form/Module.bsl
/////////////////////////////////////////////////////////////////////////////////////////////////
// Общие процедуры и функции

&НаСервере
Функция ПолучитьСписокОбъектов(НачальноеЗначение)
	
	ТекущийСписок = Новый СписокЗначений;
	
	Если ЗначениеЗаполнено(НачальноеЗначение) Тогда 
		ТекущийСписок.Добавить(НачальноеЗначение);
	КонецЕсли;
	
	// Прочитать список регистров сведений
	Для Каждого СтрокаРегистр ИЗ Метаданные.РегистрыСведений Цикл
		
		ПолноеИмя 	= СтрокаРегистр.ПолноеИмя();
		Имя 		= СтрокаРегистр.Имя;
		
		Если Не Имя = "bitmobile_СоответствиеПеречислений"
		   И Не Имя = "bitmobile_ИзмененныеДанные" 
		   И Не Имя = "bitmobile_КонтролируемыеИзмеренияРегистров" 
		   И Не ПолноеИмя = НачальноеЗначение Тогда
			
			ТекущийСписок.Добавить(ПолноеИмя);
			
		КонецЕсли;
					
	КонецЦикла;
	   
	// Прочитать список регистров накопления
	Для Каждого СтрокаРегистр ИЗ Метаданные.РегистрыНакопления Цикл 
		
		ПолноеИмя = СтрокаРегистр.ПолноеИмя();
		
		Если Не ПолноеИмя = НачальноеЗначение Тогда

			ТекущийСписок.Добавить(ПолноеИмя);
			
		КонецЕсли;
										
	КонецЦикла;
		
	Возврат ТекущийСписок;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокИзмерений()
	
	ТекущийСписок = Новый СписокЗначений;
	
	// Получить таблицу актуальных настроек
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	    |	bitmobile_НастройкиСинхронизации.Ссылка,
	    |	bitmobile_НастройкиСинхронизации.ВидОбъектаBitmobile,
	    |	bitmobile_НастройкиСинхронизации.ОбъектКонфигурации,
	    |	bitmobile_НастройкиСинхронизации.Наименование
	    |ИЗ
	    |	Справочник.bitmobile_НастройкиСинхронизации КАК bitmobile_НастройкиСинхронизации
	    |ГДЕ
	    |	bitmobile_НастройкиСинхронизации.ПометкаУдаления = ЛОЖЬ
	    |	И bitmobile_НастройкиСинхронизации.ВыгрузкаДанных = ИСТИНА";
		
	ТаблицаНастроек = Запрос.Выполнить().Выгрузить();
	
	МетаданныеРегистра = Метаданные.НайтиПоПолномуИмени(Запись.ИмяРегистра);
	
	Для Каждого ИзмерениеРегистра Из МетаданныеРегистра.Измерения Цикл
		
		СписокТипов = ИзмерениеРегистра.Тип.Типы();
		
		ДобавитьИзмерение = Ложь;
		
		Для Каждого ТипИзмерения Из СписокТипов Цикл 
			
			МетаданныеТипа = Метаданные.НайтиПоТипу(ТипИзмерения);
			
			Если Не МетаданныеТипа = Неопределено Тогда 
			
				ПолноеИмяМетаданного = МетаданныеТипа.ПолноеИмя();
				
				НайденнаяНастройка = ТаблицаНастроек.Найти(ПолноеИмяМетаданного, "ОбъектКонфигурации");
				
				Если Не НайденнаяНастройка = Неопределено Тогда 
					
					ДобавитьИзмерение = Истина;
					
				КонецЕсли;
								
			КонецЕсли;
						
		КонецЦикла;
		
		Если ДобавитьИзмерение Тогда 
			
			ТекущийСписок.Добавить(ИзмерениеРегистра.Имя);
			
		КонецЕсли;
				
	КонецЦикла;
	
	Возврат ТекущийСписок;	
	
КонецФункции	

/////////////////////////////////////////////////////////////////////////////////////////////////
// Командный интерфейс

&НаКлиенте
Процедура ИмяРегистраНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокОбъектов = ПолучитьСписокОбъектов(Элемент.ТекстРедактирования);
	
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ИмяРегистраНачалоВыбораЗавершение", ЭтаФорма)
						 , СписокОбъектов
						 , Элемент
						 , );
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяРегистраНачалоВыбораЗавершение(Результат, Параметр) Экспорт
	
	Выбор = Результат;
	
	Если НЕ Выбор = Неопределено И ЗначениеЗаполнено(Выбор.Значение) Тогда 
		
		Если НЕ Запись.ИмяРегистра = Выбор.Значение Тогда 
			
			Запись.ИмяРегистра = Выбор.Значение;
			Запись.ИмяИзмерения = "";
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущийСписок = ПолучитьСписокИзмерений();
	
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ИмяИзмеренияНачалоВыбораЗавершение", ЭтаФорма)
						 , ТекущийСписок
						 , Элемент
						 , );
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяИзмеренияНачалоВыбораЗавершение(Результат, Параметр) Экспорт
	
	Выбор = Результат;
	
	Если НЕ Выбор = Неопределено И ЗначениеЗаполнено(Выбор.Значение) Тогда 
		
		Запись.ИмяИзмерения = Выбор.Значение;
		
	КонецЕсли;
	
КонецПроцедуры
